espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_peri_pms_reg.h
/** PMS_PERI_REGION0_LOW_REG register
 *  Region0 start address configuration register
 */
#define PMS_PERI_REGION0_LOW_REG (DR_REG_LP_PERI_PMS_BASE + 0xc)
/** PMS_PERI_REGION0_LOW : R/W; bitpos: [31:2]; default: 0;
 *  Configures the high 30 bits of the start address of peripheral register's region0.
 */
#define PMS_PERI_REGION0_LOW    0x3FFFFFFFU
#define PMS_PERI_REGION0_LOW_M  (PMS_PERI_REGION0_LOW_V << PMS_PERI_REGION0_LOW_S)
#define PMS_PERI_REGION0_LOW_V  0x3FFFFFFFU
#define PMS_PERI_REGION0_LOW_S  2

/** PMS_PERI_REGION0_HIGH_REG register
 *  Region0 end address configuration register
 */
#define PMS_PERI_REGION0_HIGH_REG (DR_REG_LP_PERI_PMS_BASE + 0x10)
/** PMS_PERI_REGION0_HIGH : R/W; bitpos: [31:2]; default: 1073741823;
 *  Configures the high 30 bits of the end address of peripheral register's region0.
 */
#define PMS_PERI_REGION0_HIGH    0x3FFFFFFFU
#define PMS_PERI_REGION0_HIGH_M  (PMS_PERI_REGION0_HIGH_V << PMS_PERI_REGION0_HIGH_S)
#define PMS_PERI_REGION0_HIGH_V  0x3FFFFFFFU
#define PMS_PERI_REGION0_HIGH_S  2

/** PMS_PERI_REGION1_LOW_REG register
 *  Region1 start address configuration register
 */
#define PMS_PERI_REGION1_LOW_REG (DR_REG_LP_PERI_PMS_BASE + 0x14)
/** PMS_PERI_REGION1_LOW : R/W; bitpos: [31:2]; default: 0;
 *  Configures the high 30 bits of the start address of peripheral register's region1.
 */
#define PMS_PERI_REGION1_LOW    0x3FFFFFFFU
#define PMS_PERI_REGION1_LOW_M  (PMS_PERI_REGION1_LOW_V << PMS_PERI_REGION1_LOW_S)
#define PMS_PERI_REGION1_LOW_V  0x3FFFFFFFU
#define PMS_PERI_REGION1_LOW_S  2

/** PMS_PERI_REGION1_HIGH_REG register
 *  Region1 end address configuration register
 */
#define PMS_PERI_REGION1_HIGH_REG (DR_REG_LP_PERI_PMS_BASE + 0x18)
/** PMS_PERI_REGION1_HIGH : R/W; bitpos: [31:2]; default: 1073741823;
 *  Configures the high 30 bits of the end address of peripheral register's region1.
 */
#define PMS_PERI_REGION1_HIGH    0x3FFFFFFFU
#define PMS_PERI_REGION1_HIGH_M  (PMS_PERI_REGION1_HIGH_V << PMS_PERI_REGION1_HIGH_S)
#define PMS_PERI_REGION1_HIGH_V  0x3FFFFFFFU
#define PMS_PERI_REGION1_HIGH_S  2

/** PMS_PERI_REGION_PMS_REG register
 *  Permission register of  region
 */
#define PMS_PERI_REGION_PMS_REG (DR_REG_LP_PERI_PMS_BASE + 0x1c)
/** PMS_LP_CORE_REGION_PMS : R/W; bitpos: [1:0]; default: 3;
 *  Configures whether LP core in machine mode has permission to access address region0
 *  and address region1. Bit0 corresponds to region0 and bit1 corresponds to region1.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_LP_CORE_REGION_PMS    0x00000003U
#define PMS_LP_CORE_REGION_PMS_M  (PMS_LP_CORE_REGION_PMS_V << PMS_LP_CORE_REGION_PMS_S)
#define PMS_LP_CORE_REGION_PMS_V  0x00000003U
#define PMS_LP_CORE_REGION_PMS_S  0
/** PMS_HP_CORE0_UM_REGION_PMS : R/W; bitpos: [3:2]; default: 3;
 *  Configures whether HP CPU0 in user mode has permission to access address region0
 *  and address region1. Bit2 corresponds to region0 and bit3 corresponds to region1.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_HP_CORE0_UM_REGION_PMS    0x00000003U
#define PMS_HP_CORE0_UM_REGION_PMS_M  (PMS_HP_CORE0_UM_REGION_PMS_V << PMS_HP_CORE0_UM_REGION_PMS_S)
#define PMS_HP_CORE0_UM_REGION_PMS_V  0x00000003U
#define PMS_HP_CORE0_UM_REGION_PMS_S  2
/** PMS_HP_CORE0_MM_REGION_PMS : R/W; bitpos: [5:4]; default: 3;
 *  Configures whether HP CPU0 in machine mode has permission to access address region0
 *  and address region1. Bit4 corresponds to region0 and bit5 corresponds to region1.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_HP_CORE0_MM_REGION_PMS    0x00000003U
#define PMS_HP_CORE0_MM_REGION_PMS_M  (PMS_HP_CORE0_MM_REGION_PMS_V << PMS_HP_CORE0_MM_REGION_PMS_S)
#define PMS_HP_CORE0_MM_REGION_PMS_V  0x00000003U
#define PMS_HP_CORE0_MM_REGION_PMS_S  4
/** PMS_HP_CORE1_UM_REGION_PMS : R/W; bitpos: [7:6]; default: 3;
 *  Configures whether HP CPU1 in user mode has permission to access address region0
 *  and address region1. Bit6 corresponds to region0 and bit7 corresponds to region1.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_HP_CORE1_UM_REGION_PMS    0x00000003U
#define PMS_HP_CORE1_UM_REGION_PMS_M  (PMS_HP_CORE1_UM_REGION_PMS_V << PMS_HP_CORE1_UM_REGION_PMS_S)
#define PMS_HP_CORE1_UM_REGION_PMS_V  0x00000003U
#define PMS_HP_CORE1_UM_REGION_PMS_S  6
/** PMS_HP_CORE1_MM_REGION_PMS : R/W; bitpos: [9:8]; default: 3;
 *  Configures whether HP CPU1 in machine mode has permission to access address region0
 *  and address region1. Bit8 corresponds to region0 and bit9 corresponds to region1.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_HP_CORE1_MM_REGION_PMS    0x00000003U
#define PMS_HP_CORE1_MM_REGION_PMS_M  (PMS_HP_CORE1_MM_REGION_PMS_V << PMS_HP_CORE1_MM_REGION_PMS_S)
#define PMS_HP_CORE1_MM_REGION_PMS_V  0x00000003U
#define PMS_HP_CORE1_MM_REGION_PMS_S  8

/** PMS_PERI_REGION_2_TO_7_PMS_REG register
 *  Permission register of region 2 to 7
 */
#define PMS_PERI_REGION_2_TO_7_PMS_REG (DR_REG_LP_PERI_PMS_BASE + 0x20)
/** PMS_LP_CORE_REGION_2_TO_7_PMS : R/W; bitpos: [5:0]; default: 63;
 *  Configures whether LP core in machine mode has permission to access address region2
 *  to region7. Bit0 corresponds to region2, bit1 to region3, ..., bit5 to region7.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_LP_CORE_REGION_2_TO_7_PMS    0x0000003FU
#define PMS_LP_CORE_REGION_2_TO_7_PMS_M  (PMS_LP_CORE_REGION_2_TO_7_PMS_V << PMS_LP_CORE_REGION_2_TO_7_PMS_S)
#define PMS_LP_CORE_REGION_2_TO_7_PMS_V  0x0000003FU
#define PMS_LP_CORE_REGION_2_TO_7_PMS_S  0
/** PMS_HP_CORE0_UM_REGION_2_TO_7_PMS : R/W; bitpos: [11:6]; default: 63;
 *  Configures whether HP CPU0 in user mode has permission to access address region2
 *  to region7. Bit6 corresponds to region2, bit7 to region3, ..., bit11 to region7.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_HP_CORE0_UM_REGION_2_TO_7_PMS    0x0000003FU
#define PMS_HP_CORE0_UM_REGION_2_TO_7_PMS_M  (PMS_HP_CORE0_UM_REGION_2_TO_7_PMS_V << PMS_HP_CORE0_UM_REGION_2_TO_7_PMS_S)
#define PMS_HP_CORE0_UM_REGION_2_TO_7_PMS_V  0x0000003FU
#define PMS_HP_CORE0_UM_REGION_2_TO_7_PMS_S  6
/** PMS_HP_CORE0_MM_REGION_2_TO_7_PMS : R/W; bitpos: [17:12]; default: 63;
 *  Configures whether HP CPU0 in machine mode has permission to access address region2
 *  to region7. Bit12 corresponds to region2, bit13 to region3, ..., bit17 to region7.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_HP_CORE0_MM_REGION_2_TO_7_PMS    0x0000003FU
#define PMS_HP_CORE0_MM_REGION_2_TO_7_PMS_M  (PMS_HP_CORE0_MM_REGION_2_TO_7_PMS_V << PMS_HP_CORE0_MM_REGION_2_TO_7_PMS_S)
#define PMS_HP_CORE0_MM_REGION_2_TO_7_PMS_V  0x0000003FU
#define PMS_HP_CORE0_MM_REGION_2_TO_7_PMS_S  12
/** PMS_HP_CORE1_UM_REGION_2_TO_7_PMS : R/W; bitpos: [23:18]; default: 63;
 *  Configures whether HP CPU1 in user mode has permission to access address region2
 *  to region7. Bit18 corresponds to region2, bit19 to region3, ..., bit23 to region7.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_HP_CORE1_UM_REGION_2_TO_7_PMS    0x0000003FU
#define PMS_HP_CORE1_UM_REGION_2_TO_7_PMS_M  (PMS_HP_CORE1_UM_REGION_2_TO_7_PMS_V << PMS_HP_CORE1_UM_REGION_2_TO_7_PMS_S)
#define PMS_HP_CORE1_UM_REGION_2_TO_7_PMS_V  0x0000003FU
#define PMS_HP_CORE1_UM_REGION_2_TO_7_PMS_S  18
/** PMS_HP_CORE1_MM_REGION_2_TO_7_PMS : R/W; bitpos: [29:24]; default: 63;
 *  Configures whether HP CPU1 in machine mode has permission to access address region2
 *  to region7. Bit24 corresponds to region2, bit25 to region3, ..., bit29 to region7.
 *  0: Not allowed
 *  1: Allow
 */
#define PMS_HP_CORE1_MM_REGION_2_TO_7_PMS    0x0000003FU
#define PMS_HP_CORE1_MM_REGION_2_TO_7_PMS_M  (PMS_HP_CORE1_MM_REGION_2_TO_7_PMS_V << PMS_HP_CORE1_MM_REGION_2_TO_7_PMS_S)
#define PMS_HP_CORE1_MM_REGION_2_TO_7_PMS_V  0x0000003FU
#define PMS_HP_CORE1_MM_REGION_2_TO_7_PMS_S  24

/** PMS_PERI_REGION2_LOW_REG register
 *  Region2 start address configuration register
 */
#define PMS_PERI_REGION2_LOW_REG (DR_REG_LP_PERI_PMS_BASE + 0x24)
/** PMS_PERI_REGION2_LOW : R/W; bitpos: [31:2]; default: 0;
 *  Configures the high 30 bits of the start address of peripheral register's region2.
 */
#define PMS_PERI_REGION2_LOW    0x3FFFFFFFU
#define PMS_PERI_REGION2_LOW_M  (PMS_PERI_REGION2_LOW_V << PMS_PERI_REGION2_LOW_S)
#define PMS_PERI_REGION2_LOW_V  0x3FFFFFFFU
#define PMS_PERI_REGION2_LOW_S  2

/** PMS_PERI_REGION2_HIGH_REG register
 *  Region2 end address configuration register
 */
#define PMS_PERI_REGION2_HIGH_REG (DR_REG_LP_PERI_PMS_BASE + 0x28)
/** PMS_PERI_REGION2_HIGH : R/W; bitpos: [31:2]; default: 1073741823;
 *  Configures the high 30 bits of the end address of peripheral register's region2.
 */
#define PMS_PERI_REGION2_HIGH    0x3FFFFFFFU
#define PMS_PERI_REGION2_HIGH_M  (PMS_PERI_REGION2_HIGH_V << PMS_PERI_REGION2_HIGH_S)
#define PMS_PERI_REGION2_HIGH_V  0x3FFFFFFFU
#define PMS_PERI_REGION2_HIGH_S  2

/** PMS_PERI_REGION3_LOW_REG register
 *  Region3 start address configuration register
 */
#define PMS_PERI_REGION3_LOW_REG (DR_REG_LP_PERI_PMS_BASE + 0x2c)
/** PMS_PERI_REGION3_LOW : R/W; bitpos: [31:2]; default: 0;
 *  Configures the high 30 bits of the start address of peripheral register's region3.
 */
#define PMS_PERI_REGION3_LOW    0x3FFFFFFFU
#define PMS_PERI_REGION3_LOW_M  (PMS_PERI_REGION3_LOW_V << PMS_PERI_REGION3_LOW_S)
#define PMS_PERI_REGION3_LOW_V  0x3FFFFFFFU
#define PMS_PERI_REGION3_LOW_S  2

/** PMS_PERI_REGION3_HIGH_REG register
 *  Region3 end address configuration register
 */
#define PMS_PERI_REGION3_HIGH_REG (DR_REG_LP_PERI_PMS_BASE + 0x30)
/** PMS_PERI_REGION3_HIGH : R/W; bitpos: [31:2]; default: 1073741823;
 *  Configures the high 30 bits of the end address of peripheral register's region3.
 */
#define PMS_PERI_REGION3_HIGH    0x3FFFFFFFU
#define PMS_PERI_REGION3_HIGH_M  (PMS_PERI_REGION3_HIGH_V << PMS_PERI_REGION3_HIGH_S)
#define PMS_PERI_REGION3_HIGH_V  0x3FFFFFFFU
#define PMS_PERI_REGION3_HIGH_S  2

/** PMS_PERI_REGION4_LOW_REG register
 *  Region4 start address configuration register
 */
#define PMS_PERI_REGION4_LOW_REG (DR_REG_LP_PERI_PMS_BASE + 0x34)
/** PMS_PERI_REGION4_LOW : R/W; bitpos: [31:2]; default: 0;
 *  Configures the high 30 bits of the start address of peripheral register's region4.
 */
#define PMS_PERI_REGION4_LOW    0x3FFFFFFFU
#define PMS_PERI_REGION4_LOW_M  (PMS_PERI_REGION4_LOW_V << PMS_PERI_REGION4_LOW_S)
#define PMS_PERI_REGION4_LOW_V  0x3FFFFFFFU
#define PMS_PERI_REGION4_LOW_S  2

