espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_peri_pms_reg.h
/** PMS_PERI_REGION4_HIGH_REG register
 *  Region4 end address configuration register
 */
#define PMS_PERI_REGION4_HIGH_REG (DR_REG_LP_PERI_PMS_BASE + 0x38)
/** PMS_PERI_REGION4_HIGH : R/W; bitpos: [31:2]; default: 1073741823;
 *  Configures the high 30 bits of the end address of peripheral register's region4.
 */
#define PMS_PERI_REGION4_HIGH    0x3FFFFFFFU
#define PMS_PERI_REGION4_HIGH_M  (PMS_PERI_REGION4_HIGH_V << PMS_PERI_REGION4_HIGH_S)
#define PMS_PERI_REGION4_HIGH_V  0x3FFFFFFFU
#define PMS_PERI_REGION4_HIGH_S  2

/** PMS_PERI_REGION5_LOW_REG register
 *  Region5 start address configuration register
 */
#define PMS_PERI_REGION5_LOW_REG (DR_REG_LP_PERI_PMS_BASE + 0x3c)
/** PMS_PERI_REGION5_LOW : R/W; bitpos: [31:2]; default: 0;
 *  Configures the high 30 bits of the start address of peripheral register's region5.
 */
#define PMS_PERI_REGION5_LOW    0x3FFFFFFFU
#define PMS_PERI_REGION5_LOW_M  (PMS_PERI_REGION5_LOW_V << PMS_PERI_REGION5_LOW_S)
#define PMS_PERI_REGION5_LOW_V  0x3FFFFFFFU
#define PMS_PERI_REGION5_LOW_S  2

/** PMS_PERI_REGION5_HIGH_REG register
 *  Region5 end address configuration register
 */
#define PMS_PERI_REGION5_HIGH_REG (DR_REG_LP_PERI_PMS_BASE + 0x40)
/** PMS_PERI_REGION5_HIGH : R/W; bitpos: [31:2]; default: 1073741823;
 *  Configures the high 30 bits of the end address of peripheral register's region5.
 */
#define PMS_PERI_REGION5_HIGH    0x3FFFFFFFU
#define PMS_PERI_REGION5_HIGH_M  (PMS_PERI_REGION5_HIGH_V << PMS_PERI_REGION5_HIGH_S)
#define PMS_PERI_REGION5_HIGH_V  0x3FFFFFFFU
#define PMS_PERI_REGION5_HIGH_S  2

/** PMS_PERI_REGION6_LOW_REG register
 *  Region6 start address configuration register
 */
#define PMS_PERI_REGION6_LOW_REG (DR_REG_LP_PERI_PMS_BASE + 0x44)
/** PMS_PERI_REGION6_LOW : R/W; bitpos: [31:2]; default: 0;
 *  Configures the high 30 bits of the start address of peripheral register's region6.
 */
#define PMS_PERI_REGION6_LOW    0x3FFFFFFFU
#define PMS_PERI_REGION6_LOW_M  (PMS_PERI_REGION6_LOW_V << PMS_PERI_REGION6_LOW_S)
#define PMS_PERI_REGION6_LOW_V  0x3FFFFFFFU
#define PMS_PERI_REGION6_LOW_S  2

/** PMS_PERI_REGION6_HIGH_REG register
 *  Region6 end address configuration register
 */
#define PMS_PERI_REGION6_HIGH_REG (DR_REG_LP_PERI_PMS_BASE + 0x48)
/** PMS_PERI_REGION6_HIGH : R/W; bitpos: [31:2]; default: 1073741823;
 *  Configures the high 30 bits of the end address of peripheral register's region6.
 */
#define PMS_PERI_REGION6_HIGH    0x3FFFFFFFU
#define PMS_PERI_REGION6_HIGH_M  (PMS_PERI_REGION6_HIGH_V << PMS_PERI_REGION6_HIGH_S)
#define PMS_PERI_REGION6_HIGH_V  0x3FFFFFFFU
#define PMS_PERI_REGION6_HIGH_S  2

/** PMS_PERI_REGION7_LOW_REG register
 *  Region7 start address configuration register
 */
#define PMS_PERI_REGION7_LOW_REG (DR_REG_LP_PERI_PMS_BASE + 0x4c)
/** PMS_PERI_REGION7_LOW : R/W; bitpos: [31:2]; default: 0;
 *  Configures the high 30 bits of the start address of peripheral register's region7.
 */
#define PMS_PERI_REGION7_LOW    0x3FFFFFFFU
#define PMS_PERI_REGION7_LOW_M  (PMS_PERI_REGION7_LOW_V << PMS_PERI_REGION7_LOW_S)
#define PMS_PERI_REGION7_LOW_V  0x3FFFFFFFU
#define PMS_PERI_REGION7_LOW_S  2

/** PMS_PERI_REGION7_HIGH_REG register
 *  Region7 end address configuration register
 */
#define PMS_PERI_REGION7_HIGH_REG (DR_REG_LP_PERI_PMS_BASE + 0x50)
/** PMS_PERI_REGION7_HIGH : R/W; bitpos: [31:2]; default: 1073741823;
 *  Configures the high 30 bits of the end address of peripheral register's region7.
 */
#define PMS_PERI_REGION7_HIGH    0x3FFFFFFFU
#define PMS_PERI_REGION7_HIGH_M  (PMS_PERI_REGION7_HIGH_V << PMS_PERI_REGION7_HIGH_S)
#define PMS_PERI_REGION7_HIGH_V  0x3FFFFFFFU
#define PMS_PERI_REGION7_HIGH_S  2

#ifdef __cplusplus
}
#endif
